Revit 2027 API
PathOfTravel.CreateMultiple Method
Overload List
Name | Description
CreateMultiple(View, IList<XYZ>, IList<XYZ>) |  Creates multiple new paths of travel between same size sets of start and end points.
CreateMultiple(View, IList<XYZ>, IList<XYZ>, IList<PathOfTravelCalculationStatus>) |  Creates multiple new paths of travel between same size sets of start and end points and provides creation result statuses.
Top
See Also
Reference
PathOfTravel Class
Autodesk.Revit.DB.Analysis Namespace